##### Taps #####

tap "arl/arl" # for gitmux
tap "daipeihust/tap" # for im-select
tap "delphinus/sfmono-square" # for sfmono-square font
tap "epk/epk" # for font-sf-mono-nerd-font
tap "homebrew/bundle"
# tap "homebrew/cask"
tap "homebrew/cask-fonts"
# tap "homebrew/cask-versions"
# tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit" # for lazygit
tap "koekeishiya/formulae"
tap "lindell/multi-gitter"
tap "oven-sh/bun"
tap "shopify/shopify"

# tap "heroku/brew"


##### Formulae #####

brew "bat"
brew "bun"
brew "coreutils" # GNU File, Shell, and Text utilities
brew "daipeihust/tap/im-select"
brew "deno"
brew "dust"
brew "eza" # A mordern, maintained replacement for ls.
brew "emojify"
brew "fd"
brew "findutils" # Collection of GNU find, xargs, and locate
brew "fzf" # To install useful key bindings and fuzzy completion, run `$(brew --prefix)/opt/fzf/install`
brew "gawk" # GNU awk utility
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-lfs" # Git extension for versioning large files
brew "git-now"
brew "git-open"
brew "git-recent"
brew "gitmux"
brew "gnu-sed" # GNU implementation of the famous stream editor
brew "grep" # GNU grep, egrep, and fgrep
brew "hey" # HTTP load generator, ApacheBench (ab) replacement
brew "hyperfine" # A command-line benchmarking tool
brew "iproute2mac" # `ip` command for macOS
brew "lazygit"
brew "jq"
brew "lf" # Terminal file manager.
brew "luajit"
brew "trash-cli" # Command line interface to the freedesktop.org trashcan.
brew "mas"
brew "mmv" # Rename multiple files with editor
brew "multi-gitter" # Update multiple repositories in with one command
brew "nano"
brew "navi"
brew "ncdu"
brew "neovim"
brew "oha" # HTTP load generator, inspired by rakyll/hey with tui animation.
brew "procs"
brew "ripgrep"
# brew "shopify/shopify/shopify-cli"
# brew "shopify/shopify/themekit"
brew "skaffold"
brew "sqlite"
brew "starship"
brew "tealdeer" # Very fast implementation of tldr in Rust
brew "tmux"
brew "tree"
brew "volta"
brew "wget"
brew "zoxide" # A smarter cd command. Supports all major shells.
brew "zsh"

# brew "heroku"
# brew "macos-trash" # Move files and folders to the trash.
# brew "peco"
# brew "rename"
# brew "rust"
# brew "rustup-init"
# brew "safe-rm"
# brew "skhd" # Simple hotkey daemon for macOS.
# brew "yabai" # A tiling window manager for macOS based on binary space partitioning.


##### Apps #####

cask "authy"
cask "brave-browser"
cask "docker"
cask "fig"
cask "figma"
cask "firefox"
cask "fliqlo" # Flip clock screensaver
cask "google-chrome"
cask "google-japanese-ime"
cask "kap"
cask "logi-options-plus"
cask "lunar"
cask "maccy"
cask "ngrok"
cask "obsidian"
cask "orbstack" # A fast, light, and simple way to run containers and Linux machines on macOS. It's a supercharged alternative to Docker Desktop.
cask "postman"
cask "raycast"
cask "rectangle"
cask "replay"
cask "runjs"
cask "spotify"
cask "stats"
cask "visual-studio-code"
cask "warp"
cask "wezterm-nightly" # 'brew install --cask wezterm-nightly' to use a nightly build, 'brew upgrade --cask wezterm-nightly --no-quarantine --greedy-latest' to upgrade
cask "zoom"

# cask "alacritty"
# cask "alfred"
# cask "bitwarden"
# cask "blender"
# cask "hyper"
# cask "iconset"
# cask "iterm2"
# cask "karabiner-elements"
# cask "lapce"
# cask "slack"
# cask "spacelauncher" # Hold down spacebar while pressing a key to launch or switch to an app.
# cask "tabby"
# cask "vscodium"


##### Mac App Store #####

mas "Line", id: 539883307
mas "ScreenBrush", id: 1233965871

# mas "Be Focused - Pomodoro Timer", id: 973134470
# mas "Bitwarden", id: 1352778147
# mas "Kindle", id: 405399194
# mas "Trello", id: 1278508951


##### Fonts #####

cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-hackgen-nerd"
cask "font-sf-mono-nerd-font"
brew "sfmono-square" # SFMono Square: https://github.com/delphinus/homebrew-sfmono-square

# cask "font-fira-code"
# cask "font-meslo-lg-nerd-font"
# cask "font-ubuntu-mono-nerd-font"
# cask "font-ubuntu-nerd-font"
# cask "font-victor-mono-nerd-font"
# "operator-mono-lig" # needs to install manually: https://github.com/kiliman/operator-mono-lig 
