##### Taps #####

tap "daipeihust/tap" # for im-select
tap "delphinus/sfmono-square" # for sfmono-square font
tap "epk/epk" # for font-sf-mono-nerd-font
tap "jesseduffield/lazygit" # for lazygit
tap "lindell/multi-gitter"
tap "oven-sh/bun"


##### Formulae #####

brew "aichat" # All-in-one LLM CLI Tool
brew "bat"
brew "bun"
brew "cloudflared"
brew "composer" # Package Manager for php
brew "coreutils" # GNU File, Shell, and Text utilities
brew "daipeihust/tap/im-select"
brew "deno"
brew "devbox"
brew "direnv"
brew "dust"
brew "eza" # A mordern, maintained replacement for ls.
brew "emojify"
brew "fd"
brew "ffmpeg" # Play, record, convert stream and video
brew "findutils" # Collection of GNU find, xargs, and locate
brew "thefuck" # Magnificent app which corrects your previous console command.
brew "fzf" # To install useful key bindings and fuzzy completion, run `$(brew --prefix)/opt/fzf/install`
brew "gawk" # GNU awk utility
brew "gemini-cli"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-lfs" # Git extension for versioning large files
brew "git-now"
brew "git-open"
brew "git-recent"
brew "gitmux"
brew "gnu-sed" # GNU implementation of the famous stream editor
brew "grep" # GNU grep, egrep, and fgrep
brew "handbrake"
brew "htop" # an interactive process viewer
brew "hyperfine" # A command-line benchmarking tool
brew "iproute2mac" # `ip` command for macOS
brew "lazygit"
brew "llm" # LLM accessing tool for CLI
brew "lua-language-server"
brew "oh-my-posh"
brew "ollama"
brew "opencode"
brew "jq"
brew "lf" # Terminal file manager.
brew "luajit"
brew "mas" # Mac App Store command-line interface
brew "mmv" # Rename multiple files with editor
brew "multi-gitter" # Update multiple repositories in with one command
brew "nano"
brew "navi"
brew "ncdu"
brew "neovim"
brew "oha" # HTTP load generator, inspired by rakyll/hey with tui animation.
brew "php"
brew "procs"
brew "rbenv" # Ruby version manager
brew "ripgrep"
brew "sesh" # Smart tmux session manager
brew "shopify-cli"
# brew "shopify/shopify/themekit"
brew "skaffold"
brew "sqlite"
brew "starship"
brew "superfile" # Pretty fancy and modern terminal file manager
brew "tealdeer" # Very fast implementation of tldr in Rust
brew "tmux"
brew "tree"
brew "volta"
brew "wget"
brew "yq"
brew "zoxide" # A smarter cd command. Supports all major shells.
brew "zsh"

# brew "heroku"
# brew "macos-trash" # Move files and folders to the trash.
# brew "peco"
# brew "rename"
# brew "rust"
# brew "rustup-init"
# brew "safe-rm"
# brew "skhd" # Simple hotkey daemon for macOS.
# brew "yabai" # A tiling window manager for macOS based on binary space partitioning.


##### Apps #####
# cask "adobe-creative-cloud" # Installed via browser
cask "antigravity"
cask "aqua-voice"
cask "asana"
cask "brave-browser"
# cask "builder-io" # Installed via browser
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "clop"
cask "cursor"
# cask "cursor-cli"
# cask "codewhisperer"
cask "docker-desktop"
cask "flowvision"
cask "figma"
cask "firefox"
cask "fliqlo" # Flip clock screensaver
cask "framer"
# cask "folder peek" # No fomulae on homebrew (installed via app store)
cask "google-chrome"
cask "google-japanese-ime"
cask "insomnia"
cask "jordanbaird-ice"
cask "kap"
cask "linearmouse"
cask "local" # Develop WordPress sites locally
# cask "logi-options+"
cask "lunar"
# cask "maccy"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "omnidisksweeper"
cask "orbstack" # A fast, light, and simple way to run containers and Linux machines on macOS. It's a supercharged alternative to Docker Desktop.
cask "pearcleaner"
cask "postman"
cask "lihaoyun6/tap/quickrecorder"
cask "raindropio"
cask "raycast"
cask "rectangle"
# cask "replay"
cask "runjs"
cask "shottr"
cask "slack"
cask "spline"
cask "spotify"
cask "stats"
cask "superwhisper"
cask "visual-studio-code"
cask "warp"
cask "wezterm@nightly" # 'brew install --cask wezterm-nightly' to use a nightly build, 'brew upgrade --cask wezterm-nightly --no-quarantine --greedy-latest' to upgrade
cask "windsurf"
cask "wispr-flow"
cask "zed" # a high-performance, multiplayer code editor
cask "zen"
cask "zoom"

# cask "alacritty"
# cask "alfred"
# cask "bitwarden"
# cask "blender"
# cask "hyper"
# cask "iconset"
# cask "iterm2"
# cask "karabiner-elements"
# cask "lapce"
# cask "slack"
# cask "spacelauncher" # Hold down spacebar while pressing a key to launch or switch to an app.
# cask "tabby"
# cask "vscodium"


##### Mac App Store #####

# mas "DaVinci Resolve", id: 571213070
mas "Line", id: 539883307
mas "ScreenBrush", id: 1233965871

# mas "Be Focused - Pomodoro Timer", id: 973134470
# mas "Bitwarden", id: 1352778147
# mas "Kindle", id: 405399194
# mas "Pie Menu", id: 1631568126
# mas "Trello", id: 1278508951


##### Fonts #####

cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-hackgen-nerd"
cask "font-sf-mono-nerd-font"
brew "sfmono-square" # SFMono Square: https://github.com/delphinus/homebrew-sfmono-square

# cask "font-fira-code"
# cask "font-meslo-lg-nerd-font"
# cask "font-ubuntu-mono-nerd-font"
# cask "font-ubuntu-nerd-font"
# cask "font-victor-mono-nerd-font"
# "operator-mono-lig" # needs to install manually: https://github.com/kiliman/operator-mono-lig 
