# Taps
tap "arl/arl" # for gitmux
tap "daipeihust/tap" # for im-select
# tap "delphinus/sfmono-square" # for sfmono-square font
tap "epk/epk" # for font-sf-mono-nerd-font
# tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit" # for lazygit
tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "shopify/shopify"

# Binaries
brew "bat"
brew "bun"
brew "coreutils" # GNU File, Shell, and Text utilities
brew "daipeihust/tap/im-select"
brew "deno"
brew "dust"
brew "exa"
brew "emojify"
brew "fd"
brew "findutils" # Collection of GNU find, xargs, and locate
brew "fzf" # To install useful key bindings and fuzzy completion, run `$(brew --prefix)/opt/fzf/install`
brew "gawk" # GNU awk utility
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-lfs" # Git extension for versioning large files
brew "git-now"
brew "git-open"
brew "git-recent"
brew "gitmux"
brew "gnu-sed" # GNU implementation of the famous stream editor
brew "grep" # GNU grep, egrep, and fgrep
brew "hey" # HTTP load generator, ApacheBench (ab) replacement
# brew "heroku"
brew "jesseduffield/lazygit/lazygit"
brew "jq"
brew "lf" # Terminal file manager.
brew "luajit"
brew "trash-cli" # Command line interface to the freedesktop.org trashcan.
# brew "macos-trash" # Move files and folders to the trash.
brew "mas"
brew "mmv" # Rename multiple files with editor
brew "lindell/multi-gitter/multi-gitter" # Update multiple repositories in with one command
brew "nano"
brew "navi"
brew "ncdu"
brew "neovim"
brew "oha" # HTTP load generator, inspired by rakyll/hey with tui animation.
# brew "peco"
brew "procs"
# brew "rename"
brew "ripgrep"
# brew "rust"
# brew "rustup-init"
# brew "safe-rm"
brew "shopify/shopify/shopify-cli"
brew "shopify/shopify/themekit"
brew "skaffold"
# brew "skhd" # Simple hotkey daemon for macOS.
brew "sqlite"
brew "starship"
brew "tealdeer" # Very fast implementation of tldr in Rust
brew "tmux"
brew "tree"
# brew "volta"
brew "wget"
# brew "yabai" # A tiling window manager for macOS based on binary space partitioning.
brew "zoxide" # A smarter cd command. Supports all major shells.
brew "zsh"

# Apps
cask "alacritty"
# cask "alfred"
cask "authy"
# cask "bitwarden"
# cask "blender"
# cask "brave-browser"
# cask "docker"
cask "fig"
# cask "figma"
# cask "firefox"
# cask "google-chrome"
# cask "google-japanese-ime"
# cask "hyper"
# cask "iconset"
# cask "iterm2"
cask "karabiner-elements"
# cask "lapce"
# cask "lunar"
cask "maccy"
# cask "obsidian"
# cask "postman"
cask "raycast"
# cask "rectangle"
cask "runjs"
# cask "spotify"
cask "spacelauncher" # Hold down spacebar while pressing a key to launch or switch to an app.
cask "stats"
cask "tabby"
cask "visual-studio-code"
# cask "vscodium"
cask "warp"
# cask "wezterm" # 'brew install --cask wezterm-nightly' to use a nightly build, 'brew upgrade --cask wezterm-nightly --no-quarantine --greedy-latest' to upgrade

# Mac App Store
# mas "Bitwarden", id: 1352778147
# mas "Be Focused - Pomodoro Timer", id: 973134470
# mas "Kindle", id: 405399194
# mas "Line", id: 539883307
# mas "ScreenBrush", id: 1233965871
# mas "Trello", id: 1278508951

# Fonts
# cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-hackgen-nerd"
# cask "font-meslo-lg-nerd-font"
cask "font-sf-mono-nerd-font"
# cask "font-ubuntu-mono-nerd-font"
# cask "font-ubuntu-nerd-font"
# cask "font-victor-mono-nerd-font"
# brew "sfmono-square" # SFMono Square: https://github.com/delphinus/homebrew-sfmono-square
# "operator-mono-lig" # needs to install manually: https://github.com/kiliman/operator-mono-lig 
